# GetName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellCalculatedValueData..::..GetName Method
TableCellCalculatedValueData Class See Also
---
Gets the name of the calculated value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string GetName()
```

Visual Basic
---
```text
Public Function GetName As String
```

Visual C++
---
```text
public:
String^ GetName()
```

# See Also
TableCellCalculatedValueData Class
Autodesk.Revit.DB Namespace